msemegen/CML/lib/soc/stm32l452xx/peripherals/I2C.cpp
/*
    Name: I2C.cpp

    Copyright(c) 2020 Mateusz Semegen
    This code is licensed under MIT license (see LICENSE file for details)
*/

#ifdef STM32L452xx

// this
#include <soc/stm32l452xx/peripherals/I2C.hpp>

// externals
#include <externals/CMSIS/Device/ST/STM32L4xx/stm32l4xx.h>
#include <externals/CMSIS/Include/core_cm4.h>

// soc
#include <soc/Interrupt_guard.hpp>
#include <soc/stm32l452xx/mcu.hpp>
#include <soc/system_timer.hpp>

// cml
#include <cml/bit.hpp>
#include <cml/bit_flag.hpp>
#include <cml/debug/assert.hpp>
#include <cml/utils/wait_until.hpp>

namespace {

using namespace cml;
using namespace soc::stm32l452xx::peripherals;

struct Controller
{
    using Enable_function  = void (*)(uint32_t a_clock_source, uint32_t a_irq_priority);
    using Disable_function = void (*)();

    I2C_TypeDef* p_registers        = nullptr;
    I2C_master* p_i2c_master_handle = nullptr;
    I2C_slave* p_i2c_slave_handle   = nullptr;

    Enable_function enable   = nullptr;
    Disable_function disable = nullptr;
};

void i2c_1_enable(uint32_t a_clock_source, uint32_t a_irq_priority)
{
    assert(0 != a_clock_source);

    bit_flag::set(&(RCC->CCIPR), RCC_CCIPR_I2C1SEL, a_clock_source);
    bit_flag::set(&(RCC->APB1ENR1), RCC_APB1ENR1_I2C1EN);

    NVIC_SetPriority(I2C1_EV_IRQn, a_irq_priority);
    NVIC_EnableIRQ(I2C1_EV_IRQn);
}

void i2c_1_disable()
{
    bit_flag::clear(&(RCC->APB1ENR1), RCC_APB1ENR1_I2C1EN);
    NVIC_DisableIRQ(I2C1_EV_IRQn);
}

void i2c_2_enable(uint32_t a_clock_source, uint32_t a_irq_priority)
{
    assert(0 != a_clock_source);

    bit_flag::set(&(RCC->CCIPR), RCC_CCIPR_I2C2SEL, a_clock_source);
    bit_flag::set(&(RCC->APB1ENR1), RCC_APB1ENR1_I2C2EN);

    NVIC_SetPriority(I2C2_EV_IRQn, a_irq_priority);
    NVIC_EnableIRQ(I2C2_EV_IRQn);
}

void i2c_2_disable()
{
    bit_flag::clear(&(RCC->APB1ENR1), RCC_APB1ENR1_I2C2EN);
    NVIC_DisableIRQ(I2C2_EV_IRQn);
}

void i2c_3_enable(uint32_t a_clock_source, uint32_t a_irq_priority)
{
    assert(0 != a_clock_source);

    bit_flag::set(&(RCC->CCIPR), RCC_CCIPR_I2C3SEL, a_clock_source);
    bit_flag::set(&(RCC->APB1ENR1), RCC_APB1ENR1_I2C3EN);

    NVIC_SetPriority(I2C3_EV_IRQn, a_irq_priority);
    NVIC_EnableIRQ(I2C3_EV_IRQn);
}

void i2c_3_disable()
{
    bit_flag::clear(&(RCC->APB1ENR1), RCC_APB1ENR1_I2C3EN);
    NVIC_DisableIRQ(I2C3_EV_IRQn);
}

void i2c_4_enable(uint32_t a_clock_source, uint32_t a_irq_priority)
{
    assert(0 != a_clock_source);

    bit_flag::set(&(RCC->CCIPR2), RCC_CCIPR2_I2C4SEL, a_clock_source);
    bit_flag::set(&(RCC->APB1ENR2), RCC_APB1ENR2_I2C4EN);

    NVIC_SetPriority(I2C4_EV_IRQn, a_irq_priority);
    NVIC_EnableIRQ(I2C4_EV_IRQn);
}

void i2c_4_disable()
{
    bit_flag::clear(&(RCC->APB1ENR2), RCC_APB1ENR2_I2C4EN);
    NVIC_DisableIRQ(I2C4_EV_IRQn);
}

Controller controllers[] { { I2C1, nullptr, nullptr, i2c_1_enable, i2c_1_disable },
                           { I2C2, nullptr, nullptr, i2c_2_enable, i2c_2_disable },
                           { I2C3, nullptr, nullptr, i2c_3_enable, i2c_3_disable },
                           { I2C4, nullptr, nullptr, i2c_4_enable, i2c_4_disable } };

I2C_TypeDef* get_i2c_ptr(I2C_base::Id a_id)
{
    return controllers[static_cast<uint32_t>(a_id)].p_registers;
}

bool is_I2C_ISR_error(I2C_base::Id a_id)
{
    return bit::is_any(get_i2c_ptr(a_id)->ISR,
                       I2C_ISR_TIMEOUT | I2C_ISR_PECERR | I2C_ISR_OVR | I2C_ISR_ARLO | I2C_ISR_BERR | I2C_ISR_NACKF);
}

void clear_I2C_ISR_errors(I2C_base::Id a_id)
{
    bit_flag::set(&(get_i2c_ptr(a_id)->ICR),
                  I2C_ICR_TIMOUTCF | I2C_ICR_PECCF | I2C_ICR_OVRCF | I2C_ICR_ARLOCF | I2C_ICR_BERRCF | I2C_ICR_NACKCF);
}

I2C_base::Result::Bus_flag get_bus_status_flag_from_I2C_ISR(I2C_base::Id a_id)
{
    I2C_base::Result::Bus_flag ret = I2C_base::Result::Bus_flag::ok;
    const uint32_t isr             = get_i2c_ptr(a_id)->ISR;

    if (true == bit_flag::is(isr, I2C_ISR_OVR))
    {
        ret |= I2C_base::Result::Bus_flag::buffer_error;
    }

    if (true == bit_flag::is(isr, I2C_ISR_ARLO))
    {
        ret |= I2C_base::Result::Bus_flag::arbitration_lost;
    }

    if (true == bit_flag::is(isr, I2C_ISR_BERR))
    {
        ret |= I2C_base::Result::Bus_flag::misplaced;
    }

    if (true == bit_flag::is(isr, I2C_ISR_NACKF))
    {
        ret |= I2C_base::Result::Bus_flag::nack;
    }

    return ret;
}

I2C_base::Clock_source get_clock_source_from_RCC_CCIPR(I2C_base::Id a_id)
{
    switch (a_id)
    {
        case I2C_base::Id::_1:
        case I2C_base::Id::_2:
        case I2C_base::Id::_3: {
            return static_cast<I2C_base::Clock_source>(
                bit_flag::get(RCC->CCIPR, 0x3 << (RCC_CCIPR_I2C1SEL_Pos + static_cast<uint32_t>(a_id) * 2)) >>
                RCC_CCIPR_I2C1SEL_Pos);
        }
        break;

        default: {
            return static_cast<I2C_base::Clock_source>(bit_flag::get(RCC->CCIPR2, RCC_CCIPR2_I2C4SEL));
        }
        break;
    }
}

uint32_t get_RCC_CCIPR_from_clock_source(I2C_base::Clock_source a_clock_source, I2C_base::Id a_id)
{
    switch (a_id)
    {
        case I2C_base::Id::_1:
        case I2C_base::Id::_2:
        case I2C_base::Id::_3: {
            return static_cast<uint32_t>(a_clock_source)
                   << (RCC_CCIPR_I2C1SEL_Pos + static_cast<uint32_t>(a_id) * 2);
        }
        break;

        case I2C_base::Id::_4: {
            return static_cast<uint32_t>(a_clock_source);
        }
        break;
    }

    return 0;
}

} // namespace

extern "C" {

void interupt_handler(uint32_t a_controller_index)
{
    assert(nullptr != controllers[a_controller_index].p_i2c_master_handle ||
           nullptr != controllers[a_controller_index].p_i2c_slave_handle);

    if (nullptr != controllers[a_controller_index].p_i2c_master_handle)
    {
        i2c_master_interrupt_handler(controllers[a_controller_index].p_i2c_master_handle);
    }
    else if (nullptr != controllers[a_controller_index].p_i2c_slave_handle)
    {
        i2c_slave_interrupt_handler(controllers[a_controller_index].p_i2c_slave_handle);
    }
}

void I2C1_EV_IRQHandler()
{
    interupt_handler(0);
}

void I2C2_EV_IRQHandler()
{
    interupt_handler(1);
}

