msemegen/CML/lib/soc/stm32l452xx/peripherals/I2C.cpp
    return { bus_status, bytes };
}

I2C_master::Result I2C_master::receive_bytes_polling(uint8_t a_slave_address,
                                                     void* a_p_data,
                                                     uint32_t a_data_size_in_bytes,
                                                     time::tick a_timeout)
{
    assert(a_slave_address <= 0xFE);
    assert(nullptr != a_p_data);
    assert(a_data_size_in_bytes > 0 && a_data_size_in_bytes <= 255);
    assert(a_timeout > 0);

    time::tick start = system_timer::get();

    const uint32_t address_mask   = static_cast<uint32_t>(a_slave_address) & I2C_CR2_SADD;
    const uint32_t data_size_mask = static_cast<uint32_t>(a_data_size_in_bytes) << I2C_CR2_NBYTES_Pos;

    get_i2c_ptr(this->id)->CR2 = address_mask | data_size_mask | I2C_CR2_START | I2C_CR2_AUTOEND | I2C_CR2_RD_WRN;

    uint32_t bytes              = 0;
    bool error                  = false;
    Result::Bus_flag bus_status = Result::Bus_flag::ok;

    while (false == bit_flag::is(get_i2c_ptr(this->id)->ISR, I2C_ISR_STOPF) && false == error &&
           a_timeout >= time::diff(system_timer::get(), start))
    {
        if (true == bit_flag::is(get_i2c_ptr(this->id)->ISR, I2C_ISR_RXNE) && bytes < a_data_size_in_bytes)
        {
            static_cast<uint8_t*>(a_p_data)[bytes++] = static_cast<uint8_t>(get_i2c_ptr(this->id)->RXDR);
        }

        error = is_I2C_ISR_error(this->id);
    }

    if (false == error)
    {
        if (true == bit_flag::is(get_i2c_ptr(this->id)->ISR, I2C_ISR_RXNE) && bytes < a_data_size_in_bytes)
        {
            static_cast<uint8_t*>(a_p_data)[bytes++] = static_cast<uint8_t>(get_i2c_ptr(this->id)->RXDR);
        }
    }
    else
    {
        bus_status = get_bus_status_flag_from_I2C_ISR(this->id);

        if (Result::Bus_flag::ok != bus_status)
        {
            clear_I2C_ISR_errors(this->id);
        }
    }

    bit_flag::set(&(get_i2c_ptr(this->id)->ICR), I2C_ICR_STOPCF);
    get_i2c_ptr(this->id)->CR2 = 0;

    return { bus_status, bytes };
}

void I2C_master::register_transmit_callback(uint8_t a_slave_address,
                                            const Transmit_callback& a_callback,
                                            uint32_t a_data_length_in_bytes)
{
    assert(a_slave_address <= 0xFE);
    assert(nullptr != a_callback.function);

    Interrupt_guard guard;

    this->transmit_callback = a_callback;

    const uint32_t address_mask   = static_cast<uint32_t>(a_slave_address) & I2C_CR2_SADD;
    const uint32_t data_size_mask = static_cast<uint32_t>(a_data_length_in_bytes) << I2C_CR2_NBYTES_Pos;

    get_i2c_ptr(this->id)->CR2 = address_mask | data_size_mask | I2C_CR2_START | I2C_CR2_AUTOEND;
    bit_flag::set(&(get_i2c_ptr(this->id)->CR1), I2C_CR1_TXIE | I2C_CR1_STOPIE);
}

void I2C_master::register_receive_callback(uint8_t a_slave_address,
                                           const Receive_callback& a_callback,
                                           uint32_t a_data_length_in_bytes)
{
    assert(a_slave_address <= 0xFE);
    assert(nullptr != a_callback.function);

    Interrupt_guard guard;

    this->receive_callback = a_callback;

    const uint32_t address_mask   = static_cast<uint32_t>(a_slave_address) & I2C_CR2_SADD;
    const uint32_t data_size_mask = static_cast<uint32_t>(a_data_length_in_bytes) << I2C_CR2_NBYTES_Pos;

    get_i2c_ptr(this->id)->CR2 = address_mask | data_size_mask | I2C_CR2_START | I2C_CR2_AUTOEND | I2C_CR2_RD_WRN;
    bit_flag::set(&(get_i2c_ptr(this->id)->CR1), I2C_CR1_RXIE | I2C_CR1_STOPIE);
}

void I2C_master::register_bus_status_callback(const Bus_status_callback& a_callback)
{
    assert(nullptr != a_callback.function);

    Interrupt_guard guard;

    this->bus_status_callback = a_callback;
    bit_flag::set(&(get_i2c_ptr(this->id)->CR1), I2C_CR1_NACKIE | I2C_CR1_ERRIE);
}

void I2C_master::unregister_transmit_callback()
{
    assert(nullptr != this->transmit_callback.function);

    Interrupt_guard guard;

    bit_flag::clear(&(get_i2c_ptr(this->id)->CR1), I2C_CR1_TXIE | I2C_CR1_STOPIE);

    this->transmit_callback = { nullptr, nullptr };
}

void I2C_master::unregister_receive_callback()
{
    assert(nullptr != this->receive_callback.function);

    Interrupt_guard guard;

    bit_flag::clear(&(get_i2c_ptr(this->id)->CR1), I2C_CR1_RXIE | I2C_CR1_STOPIE);

    this->receive_callback = { nullptr, nullptr };
}

void I2C_master::unregister_bus_status_callback()
{
    assert(nullptr != this->bus_status_callback.function);

    Interrupt_guard guard;

    bit_flag::clear(&(get_i2c_ptr(this->id)->CR1), I2C_CR1_NACKIE | I2C_CR1_ERRIE);

    this->bus_status_callback = { nullptr, nullptr };
}

bool I2C_master::is_slave_connected(uint8_t a_slave_address, time::tick a_timeout) const
{
    assert(a_slave_address <= 0xFE);
    assert(a_timeout > 0);

    time::tick start = system_timer::get();

    const uint32_t address_mask = (static_cast<uint32_t>(a_slave_address)) & I2C_CR2_SADD;

    get_i2c_ptr(this->id)->CR2 = address_mask | I2C_CR2_AUTOEND | I2C_CR2_START;

    bool ret = wait_until::flag(&(get_i2c_ptr(this->id)->ISR), I2C_ISR_STOPF, false, start, a_timeout);

    if (true == ret)
    {
        if (true == bit_flag::is(get_i2c_ptr(this->id)->ISR, I2C_ISR_NACKF))
        {
            bit_flag::set(&(get_i2c_ptr(this->id)->ICR), I2C_ICR_NACKCF);
            ret = false;
        }
        else
        {
            volatile auto x = 0xFF;
            x               = x;
        }
    }

    bit_flag::set(&(get_i2c_ptr(this->id)->ICR), I2C_ICR_STOPCF);
    wait_until::flag(&(get_i2c_ptr(this->id)->ISR), I2C_ISR_STOPF, true);
    get_i2c_ptr(this->id)->CR2 = 0;

    return ret;
}

void I2C_slave::enable(const Config& a_config, Clock_source a_clock_source, uint32_t a_irq_priority)
{
    assert(a_config.address <= 0x7F);

    controllers[static_cast<uint32_t>(this->id)].enable(get_RCC_CCIPR_from_clock_source(a_clock_source, this->id),
                                                        a_irq_priority);
    controllers[static_cast<uint32_t>(this->id)].p_i2c_slave_handle = this;

    get_i2c_ptr(this->id)->CR1     = 0;
    get_i2c_ptr(this->id)->TIMINGR = a_config.timings;
    get_i2c_ptr(this->id)->OAR1    = I2C_OAR1_OA1EN | (a_config.address);
    get_i2c_ptr(this->id)->CR1     = (false == a_config.analog_filter ? I2C_CR1_ANFOFF : 0) |
                                 (true == a_config.crc_enable ? I2C_CR1_PECEN : 0) | I2C_CR1_PE;

