msemegen/CML/lib/soc/stm32l452xx/peripherals/I2C.cpp
    if (true == a_config.fast_plus)
    {
        assert(true == mcu::is_syscfg_enabled());

        bit::set(&(SYSCFG->CFGR1), SYSCFG_CFGR1_I2C1_FMP_Pos + static_cast<uint32_t>(this->id));
    }
}

void I2C_slave::diasble()
{
    get_i2c_ptr(this->id)->CR1 = 0;

    if (true == this->is_fast_plus())
    {
        bit::clear(&(SYSCFG->CFGR1), SYSCFG_CFGR1_I2C1_FMP_Pos + static_cast<uint32_t>(this->id));
    }

    controllers[static_cast<uint32_t>(this->id)].disable();
    controllers[static_cast<uint32_t>(this->id)].p_i2c_slave_handle = nullptr;
}

I2C_slave::Result I2C_slave::transmit_bytes_polling(const void* a_p_data, uint32_t a_data_size_in_bytes)
{
    assert(nullptr != a_p_data);
    assert(a_data_size_in_bytes > 0 && a_data_size_in_bytes <= 255);

    constexpr uint32_t error_mask = I2C_ISR_TIMEOUT | I2C_ISR_PECERR | I2C_ISR_OVR | I2C_ISR_ARLO | I2C_ISR_BERR;

    uint32_t bytes              = 0;
    bool error                  = false;
    Result::Bus_flag bus_status = Result::Bus_flag::ok;

    while ((false == bit_flag::is(get_i2c_ptr(this->id)->ISR, I2C_ISR_STOPF) &&
            false == bit_flag::is(get_i2c_ptr(this->id)->ISR, I2C_ISR_NACKF)) &&
           false == error)
    {
        if (true == bit_flag::is(get_i2c_ptr(this->id)->ISR, I2C_ISR_ADDR))
        {
            bit_flag::set(&(get_i2c_ptr(this->id)->ICR), I2C_ICR_ADDRCF);
        }

        if (true == bit_flag::is(get_i2c_ptr(this->id)->ISR, I2C_ISR_TXE) && bytes < a_data_size_in_bytes)
        {
            get_i2c_ptr(this->id)->TXDR = static_cast<const uint8_t*>(a_p_data)[bytes++];
        }

        error = bit::is_any(get_i2c_ptr(this->id)->ISR, error_mask);
    }

    if (true == bit_flag::is(get_i2c_ptr(this->id)->ISR, I2C_ISR_STOPF) &&
        true == bit_flag::is(get_i2c_ptr(this->id)->ISR, I2C_ISR_NACKF))
    {
        bit_flag::set(&(get_i2c_ptr(this->id)->ICR), I2C_ICR_NACKCF);
    }

    if (true == error)
    {
        bus_status = get_bus_status_flag_from_I2C_ISR(this->id);

        if (Result::Bus_flag::ok != bus_status)
        {
            clear_I2C_ISR_errors(this->id);
        }
    }

    bit_flag::set(&(get_i2c_ptr(this->id)->ICR), I2C_ICR_STOPCF);

    return { bus_status, bytes };
}

I2C_slave::Result
I2C_slave::transmit_bytes_polling(const void* a_p_data, uint32_t a_data_size_in_bytes, time::tick a_timeout)
{
    assert(nullptr != a_p_data);
    assert(a_data_size_in_bytes > 0 && a_data_size_in_bytes <= 255);
    assert(a_timeout > 0);

    time::tick start = system_timer::get();

    constexpr uint32_t error_mask = I2C_ISR_TIMEOUT | I2C_ISR_PECERR | I2C_ISR_OVR | I2C_ISR_ARLO | I2C_ISR_BERR;

    uint32_t bytes              = 0;
    bool error                  = false;
    Result::Bus_flag bus_status = Result::Bus_flag::ok;

    while ((false == bit_flag::is(get_i2c_ptr(this->id)->ISR, I2C_ISR_STOPF) &&
            false == bit_flag::is(get_i2c_ptr(this->id)->ISR, I2C_ISR_NACKF)) &&
           false == error && a_timeout >= time::diff(system_timer::get(), start))
    {
        if (true == bit_flag::is(get_i2c_ptr(this->id)->ISR, I2C_ISR_ADDR))
        {
            bit_flag::set(&(get_i2c_ptr(this->id)->ICR), I2C_ICR_ADDRCF);
        }

        if (true == bit_flag::is(get_i2c_ptr(this->id)->ISR, I2C_ISR_TXE) && bytes < a_data_size_in_bytes)
        {
            get_i2c_ptr(this->id)->TXDR = static_cast<const uint8_t*>(a_p_data)[bytes++];
        }

        error = bit::is_any(get_i2c_ptr(this->id)->ISR, error_mask);
    }

    if (true == bit_flag::is(get_i2c_ptr(this->id)->ISR, I2C_ISR_STOPF) &&
        true == bit_flag::is(get_i2c_ptr(this->id)->ISR, I2C_ISR_NACKF))
    {
        bit_flag::set(&(get_i2c_ptr(this->id)->ICR), I2C_ICR_NACKCF);
    }

    if (true == error)
    {
        bus_status = get_bus_status_flag_from_I2C_ISR(this->id);

        if (Result::Bus_flag::ok != bus_status)
        {
            clear_I2C_ISR_errors(this->id);
        }
    }

    bit_flag::set(&(get_i2c_ptr(this->id)->ICR), I2C_ICR_STOPCF);

    return { bus_status, bytes };
}

I2C_slave::Result I2C_slave::receive_bytes_polling(void* a_p_data, uint32_t a_data_size_in_bytes)
{
    assert(nullptr != a_p_data);
    assert(a_data_size_in_bytes > 0 && a_data_size_in_bytes <= 255);

    uint32_t bytes              = 0;
    bool error                  = false;
    Result::Bus_flag bus_status = Result::Bus_flag::ok;

    while (false == bit_flag::is(get_i2c_ptr(this->id)->ISR, I2C_ISR_STOPF) && false == error)
    {
        if (true == bit_flag::is(get_i2c_ptr(this->id)->ISR, I2C_ISR_ADDR))
        {
            bit_flag::set(&(get_i2c_ptr(this->id)->ICR), I2C_ICR_ADDRCF);
        }

        if (true == bit_flag::is(get_i2c_ptr(this->id)->ISR, I2C_ISR_RXNE))
        {
            const uint8_t rxdr = static_cast<uint8_t>(get_i2c_ptr(this->id)->RXDR);

            if (bytes < a_data_size_in_bytes)
            {
                static_cast<uint8_t*>(a_p_data)[bytes++] = rxdr;
            }
        }

        error = is_I2C_ISR_error(this->id);
    }

    if (false == error)
    {
        if (true == bit_flag::is(get_i2c_ptr(this->id)->ISR, I2C_ISR_RXNE) && bytes < a_data_size_in_bytes)
        {
            static_cast<uint8_t*>(a_p_data)[bytes++] = static_cast<uint8_t>(get_i2c_ptr(this->id)->RXDR);
        }
    }
    else
    {
        bus_status = get_bus_status_flag_from_I2C_ISR(this->id);

        if (Result::Bus_flag::ok != bus_status)
        {
            clear_I2C_ISR_errors(this->id);
        }
    }

    bit_flag::set(&(get_i2c_ptr(this->id)->ICR), I2C_ICR_STOPCF);

    return { bus_status, bytes };
}

I2C_slave::Result I2C_slave::receive_bytes_polling(void* a_p_data, uint32_t a_data_size_in_bytes, time::tick a_timeout)
{
    assert(nullptr != a_p_data);
    assert(a_data_size_in_bytes > 0 && a_data_size_in_bytes <= 255);
    assert(a_timeout > 0);

    time::tick start = system_timer::get();

    uint32_t bytes              = 0;
    bool error                  = false;
    Result::Bus_flag bus_status = Result::Bus_flag::ok;

